InformationRegisters/доп_сл_СерверныеСеансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>доп_сл_СерверныеСеансы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресСервераЛицензий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПортСервераЛицензий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПортАссистента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьProxy</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МоментРегистрацииВРегистре</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСеанса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/доп_сл_сервер_ассистент/Ext/Module.bsl
Функция ПолучитьЯзыкПользователя()
	ТекЯзык = ТекущийЯзык();
	Если ТипЗнч(ТекЯзык) = Тип("ОбъектМетаданных") Тогда
		ТекЯзык = ТекЯзык.КодЯзыка;
	КонецЕсли;
	Если ТипЗнч(ТекЯзык) <> Тип("Строка") Или ТекЯзык = "" Тогда
		ТекЯзык = "ru";
	КонецЕсли;
	Возврат ТекЯзык;
КонецФункции
Функция ПолучитьЯзыкКлиентаЛицензирования() Экспорт
	Возврат ЗагрузитьПараметрИзХранилищаПользователя("ПараметрыКлиентаЛицензирования.ЯзыкКлиентаЛицензирования");
КонецФункции
Процедура СборщикМусораПользовательскогоСеансовогоХранилища()
	ТекущийПользователь = "";
	СеансыИБ = ПолучитьСеансыИнформационнойБазы();
	НомераАктивныхСоединений = Новый Массив;
	Для каждого ЭлементЗн Из СеансыИБ Цикл
		НомераАктивныхСоединений.Добавить(Формат(ЭлементЗн.НомерСеанса, "ЧН=0; ЧГ=0"));
	КонецЦикла;
	Попытка
		СозданныеХранилища = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6_Ассистент", "НомераСтруктурСеансовыхПараметров", , ТекущийПользователь);
	Исключение
		СозданныеХранилища = Неопределено;
	КонецПопытки;
	ТекущиеХранилища = Новый Массив;
	Если ЗначениеОпределено(СозданныеХранилища) Тогда
		Для каждого НомерСеанса Из СозданныеХранилища Цикл
			Если Не ЗначениеОпределено(НомераАктивныхСоединений.Найти(НомерСеанса)) Тогда
				Попытка
					ХранилищеОбщихНастроек.Удалить("доп_СистемаЛицензирования_1_6_Ассистент", "СеансовыеПараметры_" + НомерСеанса, ТекущийПользователь);
				Исключение
				КонецПопытки;
			Иначе
				ТекущиеХранилища.Добавить(НомерСеанса);
			КонецЕсли;
		КонецЦикла;
		ХранилищеОбщихНастроек.Сохранить("доп_СистемаЛицензирования_1_6_Ассистент", "НомераСтруктурСеансовыхПараметров", ТекущиеХранилища, , ТекущийПользователь);
	КонецЕсли;
КонецПроцедуры
Функция ПользовательскоеСеансовоеХранилищеИнициализировано()
	Результат = Ложь;
	ТекущийПользователь = "";
	НСИБ = ПараметрыСеанса.доп_сл_БуферЛицензирования;
	Если ПараметрыСеанса.доп_сл_БуферЛицензирования = "" Тогда
		НСИБ = Формат(НомерСеансаИнформационнойБазы(), "ЧН=0; ЧГ=0");
	КонецЕсли;
	СеансовоеХранилище = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6_Ассистент", "СеансовыеПараметры_" + НСИБ, , ТекущийПользователь);
	Если ЗначениеЗаполнено(СеансовоеХранилище) И ТипЗнч(СеансовоеХранилище) = Тип("Структура") И СеансовоеХранилище.Свойство("ИдНастроек") Тогда
		Результат = ПараметрыСеанса.доп_сл_ИдНастроек = СеансовоеХранилище.ИдНастроек;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ИнициализироватьПользовательскоеСеансовоеХранилище(Пересоздать = Ложь)
	ТекущийПользователь = "";
	Если ПараметрыСеанса.доп_сл_БуферЛицензирования = "" Тогда
		ПараметрыСеанса.доп_сл_БуферЛицензирования = Формат(НомерСеансаИнформационнойБазы(), "ЧН=0; ЧГ=0");
	КонецЕсли;
	НСИБ = ПараметрыСеанса.доп_сл_БуферЛицензирования;
	Попытка
		СеансовоеХранилище = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6_Ассистент", "СеансовыеПараметры_" + НСИБ, , ТекущийПользователь);
	Исключение
		СеансовоеХранилище = Неопределено;
	КонецПопытки;
	Если Не ЗначениеОпределено(СеансовоеХранилище) Или Пересоздать Тогда
		СборщикМусораПользовательскогоСеансовогоХранилища();
		Если ЗначениеОпределено(СеансовоеХранилище) Тогда
			ХранилищеОбщихНастроек.Удалить("доп_СистемаЛицензирования_1_6_Ассистент", "СеансовыеПараметры_" + НСИБ, ТекущийПользователь);
		КонецЕсли;
		СтруктураПараметрыКлиентаЛицензирования = Новый Структура;
		СтруктураПараметрыКлиентаЛицензирования.Вставить("ИдентификаторОсновногоПродукта", Неопределено);
		СтруктураПараметрыКлиентаЛицензирования.Вставить("ПоддерживаетсяВыборВерсий", Ложь);
		СтруктураПараметрыКлиентаЛицензирования.Вставить("ЯзыкКлиентаЛицензирования", ПолучитьЯзыкПользователя());
		СеансовоеХранилище = Новый Структура;
		СеансовоеХранилище.Вставить("ИдНастроек", ПараметрыСеанса.доп_сл_ИдНастроек);
		СеансовоеХранилище.Вставить("ПараметрыКлиентаЛицензирования", СтруктураПараметрыКлиентаЛицензирования);
		СеансовоеХранилище.Вставить("ВыполнятьПоддержкуКлиента", Ложь);
		СеансовоеХранилище.Вставить("ПоддержкаКлиентаПоследняяОшибка", Неопределено);
		СеансовоеХранилище.Вставить("ЧислоОшибокПоддержкиРаботыКлиента", 0);
		СеансовоеХранилище.Вставить("ТребуетсяПереполучитьЛицензию", Ложь);
		СеансовоеХранилище.Вставить("SessionID", "");
		СеансовоеХранилище.Вставить("КлючФЗИнтервальногоОбращения", Строка(Новый УникальныйИдентификатор));
		ХранилищеОбщихНастроек.Сохранить("доп_СистемаЛицензирования_1_6_Ассистент", "СеансовыеПараметры_" + НСИБ, СеансовоеХранилище, , ТекущийПользователь);
		Попытка
			СозданныеХранилища = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6_Ассистент", "НомераСтруктурСеансовыхПараметров", , ТекущийПользователь);
		Исключение
			СозданныеХранилища = Неопределено;
		КонецПопытки;
		Если ЗначениеОпределено(СозданныеХранилища) Тогда
			Если Не ЗначениеОпределено(СозданныеХранилища.Найти(НСИБ)) Тогда
				СозданныеХранилища.Добавить(НСИБ);
			КонецЕсли;
		Иначе
			СозданныеХранилища = Новый Массив;
			СозданныеХранилища.Добавить(НСИБ);
		КонецЕсли;
		ХранилищеОбщихНастроек.Сохранить("доп_СистемаЛицензирования_1_6_Ассистент", "НомераСтруктурСеансовыхПараметров", СозданныеХранилища, , ТекущийПользователь);
	КонецЕсли;
КонецФункции
Функция ИнициализироватьПользовательскоеПостоянноеХранилище()
	ТекущийПользователь = "";
	Попытка
		ПостоянноеХранилище = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6_Ассистент", "ПостоянныеПараметры", , ТекущийПользователь);
	Исключение
		ПостоянноеХранилище = Неопределено;
	КонецПопытки;
	Если Не ЗначениеОпределено(ПостоянноеХранилище) Тогда
		ПостоянныеПараметры = Новый Структура;
		ПостоянныеПараметры.Вставить("ВерсияХранилища", 1);
		ХранилищеОбщихНастроек.Сохранить("доп_СистемаЛицензирования_1_6_Ассистент", "ПостоянныеПараметры", ПостоянныеПараметры, , ТекущийПользователь);
	КонецЕсли;
КонецФункции
Процедура ЗаписатьПараметрВХранилищеПользователя(Ключ, Значение, ВПостоянное = Ложь) Экспорт
	Инициализировать();
	ТекущийПользователь = "";
	Если ВПостоянное Тогда
		КлючНастроек = "ПостоянныеПараметры";
	Иначе
		Если ПараметрыСеанса.доп_сл_БуферЛицензирования = "" Тогда
			ПараметрыСеанса.доп_сл_БуферЛицензирования = Формат(НомерСеансаИнформационнойБазы(), "ЧН=0; ЧГ=0");
		КонецЕсли;
		КлючНастроек = "СеансовыеПараметры_" + ПараметрыСеанса.доп_сл_БуферЛицензирования;
	КонецЕсли;
	Попытка
		ХранилищеПараметров = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6_Ассистент", КлючНастроек, , ТекущийПользователь);
		Возврат;
	Исключение
		ХранилищеПараметров = Неопределено;
	КонецПопытки;
	ХранилищеОбщихНастроек.Сохранить("доп_СистемаЛицензирования_1_6_Ассистент", КлючНастроек, ХранилищеПараметров, , ТекущийПользователь);
КонецПроцедуры
Функция ЗагрузитьПараметрИзХранилищаПользователя(Ключ, ИзПостоянного = Ложь) Экспорт
	Инициализировать();
	Результат = Неопределено;
	ТекущийПользователь = "";
	Если ИзПостоянного Тогда
		КлючНастроек = "ПостоянныеПараметры";
	Иначе
		Если ПараметрыСеанса.доп_сл_БуферЛицензирования = "" Тогда
			ПараметрыСеанса.доп_сл_БуферЛицензирования = Формат(НомерСеансаИнформационнойБазы(), "ЧН=0; ЧГ=0");
		КонецЕсли;
		КлючНастроек = "СеансовыеПараметры_" + ПараметрыСеанса.доп_сл_БуферЛицензирования;
	КонецЕсли;
	Попытка
		ХранилищеПараметров = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6_Ассистент", КлючНастроек, , ТекущийПользователь);
		Выполнить("Результат = ХранилищеПараметров" + ?(Ключ = "", Ключ, "." + Ключ) + ";");
	Исключение
		ХранилищеПараметров = Неопределено;
	КонецПопытки;
	Возврат Результат;
КонецФункции
Процедура ВключитьТестирование() Экспорт
	доп_сл_сервер.УстановитьБуфер("{66C413ED-C236-483C-BE47-8ECD7D3B2FC2}", Истина);
КонецПроцедуры
Процедура ЗарегистрироватьСеансВРегистре(ИдентификаторСеанса, АдресСервераЛицензий, ПортСервераЛицензий, ПортАссистента, ИспользоватьProxy) Экспорт
	Запись = РегистрыСведений.доп_сл_СерверныеСеансы.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСеанса = ИдентификаторСеанса;
	Запись.АдресСервераЛицензий = АдресСервераЛицензий;
	Запись.ПортСервераЛицензий = ПортСервераЛицензий;
	Запись.ПортАссистента = ПортАссистента;
	Запись.ИспользоватьProxy = ИспользоватьProxy;
	Запись.МоментРегистрацииВРегистре = ТекущаяДата();
	Запись.Записать();
КонецПроцедуры
Процедура УдалитьРегистрациюСеансаИзРегистра(ИдентификаторСеанса) Экспорт
	Запись = РегистрыСведений.доп_сл_СерверныеСеансы.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторСеанса = ИдентификаторСеанса;
	Запись.Прочитать();
	Запись.Удалить();
КонецПроцедуры
Процедура ВыполнитьПоддержкуРаботыКлиента(СнятьАктивныеЗадачи = Ложь) Экспорт
	ВыполнятьПоддержкуКлиента = ЗагрузитьПараметрИзХранилищаПользователя("ВыполнятьПоддержкуКлиента");
	НомерСоединенияИнформационнойБазы = ПараметрыСеанса.доп_сл_БуферЛицензирования;
	ИдНастроек = ПараметрыСеанса.доп_сл_ИдНастроек;
	SessionID = ЗагрузитьПараметрИзХранилищаПользователя("SessionID");
	Если доп_сл_сервер.ЭтоСервернаяБаза() Или доп_сл_сервер.ПоддержкаКода(8, 3, 3) Тогда
		КлючФЗИнтервальногоОбращения = ЗагрузитьПараметрИзХранилищаПользователя("КлючФЗИнтервальногоОбращения");
		ЗапуститьФЗ = ВыполнятьПоддержкуКлиента И Не СнятьАктивныеЗадачи;
		Если СнятьАктивныеЗадачи Или ВыполнятьПоддержкуКлиента Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Ключ", КлючФЗИнтервальногоОбращения);
			Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
			НайденныеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			Если НайденныеФоновыеЗадания.Количество() > 0 Тогда
				ФЗ = НайденныеФоновыеЗадания[0];
				ФЗ.Отменить();
				ЗапуститьФЗ = Ложь;
				ЧислоОшибокПоддержкиРаботыКлиента = ЗагрузитьПараметрИзХранилищаПользователя("ЧислоОшибокПоддержкиРаботыКлиента");
				ЗаписатьПараметрВХранилищеПользователя("ЧислоОшибокПоддержкиРаботыКлиента", ЧислоОшибокПоддержкиРаботыКлиента + 1);
				Если ЧислоОшибокПоддержкиРаботыКлиента = 5 Тогда
					ЗаписатьПараметрВХранилищеПользователя("ВыполнятьПоддержкуКлиента", Ложь);
					ЗаписатьПараметрВХранилищеПользователя("ТребуетсяПереполучитьЛицензию", Истина);
					ЗаписатьПараметрВХранилищеПользователя("ПоддержкаКлиентаПоследняяОшибка", ИнициализироватьРезультат(9));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЗапуститьФЗ Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НомерРодительскогоСеансаИБ", НомерСоединенияИнформационнойБазы);
			СтруктураПараметров.Вставить("ИдНастроек", ИдНастроек);
			СтруктураПараметров.Вставить("SessionID", SessionID);
			Параметры = Новый Массив;
			Параметры.Добавить(СтруктураПараметров);
			Если ЗначениеЗаполнено(SessionID) Тогда
				ФЗ = ФоновыеЗадания.Выполнить("доп_сл_сервер_ассистент.ОбработкаФЗИнтервальнойПоддержкиКлиента", Параметры, КлючФЗИнтервальногоОбращения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(SessionID) И ВыполнятьПоддержкуКлиента Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НомерРодительскогоСеансаИБ", НомерСоединенияИнформационнойБазы);
			СтруктураПараметров.Вставить("ИдНастроек", ИдНастроек);
			СтруктураПараметров.Вставить("SessionID", SessionID);
			ОбработкаФЗИнтервальнойПоддержкиКлиента(СтруктураПараметров);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ОбработкаФЗИнтервальнойПоддержкиКлиента(Параметры) Экспорт
	ПараметрыСеанса.доп_сл_БуферЛицензирования = Параметры.НомерРодительскогоСеансаИБ;
	ПараметрыСеанса.доп_сл_ИдНастроек = Параметры.ИдНастроек;
	SessionID = Параметры.SessionID;
	Результат = lsaAPI_SlExtendAssistantSessionLifeTime(SessionID);
	Если Не НетОшибок(Результат) Тогда
		ЧислоОшибокПоддержкиРаботыКлиента = ЗагрузитьПараметрИзХранилищаПользователя("ЧислоОшибокПоддержкиРаботыКлиента");
		ЧислоОшибокПоддержкиРаботыКлиента = ЧислоОшибокПоддержкиРаботыКлиента + 1;
		ЗаписатьПараметрВХранилищеПользователя("ЧислоОшибокПоддержкиРаботыКлиента", ЧислоОшибокПоддержкиРаботыКлиента);
		Если ЧислоОшибокПоддержкиРаботыКлиента = 1 Тогда
			ЗаписатьПараметрВХранилищеПользователя("ВыполнятьПоддержкуКлиента", Ложь);
			ЗаписатьПараметрВХранилищеПользователя("ТребуетсяПереполучитьЛицензию", Истина);
			ЗаписатьПараметрВХранилищеПользователя("ПоддержкаКлиентаПоследняяОшибка", Результат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ОбработкаРЗМенеджерСеансов() Экспорт
	Если доп_сл_сервер.ЭтоСервернаяБаза() Тогда
		СеансыИБ = ПолучитьСеансыИнформационнойБазы();
		НомераАктивныхСоединений = Новый Массив;
		Для каждого ЭлементЗн Из СеансыИБ Цикл
			Если ЭлементЗн.ИмяПриложения <> "SrvrConsole" И ЭлементЗн.ИмяПриложения <> "COMConsole" И ЭлементЗн.ИмяПриложения <> "JobScheduler" И ЭлементЗн.ИмяПриложения <> "BackgroundJob" И ЭлементЗн.ИмяПриложения <> "SystemBackgroundJob" И ЭлементЗн.ИмяПриложения <> "Designer" Тогда
				НомераАктивныхСоединений.Добавить(Формат(70000 + ЭлементЗн.НомерСеанса, "ЧН=0; ЧГ=0"));
			КонецЕсли;
		КонецЦикла;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ		|	доп_сл_СерверныеСеансы.ИдентификаторСеанса,		|	доп_сл_СерверныеСеансы.АдресСервераЛицензий,		|	доп_сл_СерверныеСеансы.ПортСервераЛицензий,		|	доп_сл_СерверныеСеансы.ПортАссистента,		|   доп_сл_СерверныеСеансы.ИспользоватьProxy,		|	ВЫБОР		|		КОГДА доп_сл_СерверныеСеансы.ИдентификаторСеанса В (&НомераАктивныхСоединений)		|			ТОГДА ИСТИНА		|		ИНАЧЕ ЛОЖЬ		|	КОНЕЦ КАК СоединениеАктивно		|ИЗ		|	РегистрСведений.доп_сл_СерверныеСеансы КАК доп_сл_СерверныеСеансы";
		Запрос.УстановитьПараметр("НомераАктивныхСоединений", НомераАктивныхСоединений);
		РезультатЗапроса = Запрос.Выполнить();
		РезультатЗапросаВыборка = РезультатЗапроса.Выбрать();
		Пока РезультатЗапросаВыборка.Следующий() Цикл
			Если Не РезультатЗапросаВыборка.СоединениеАктивно Тогда
				ПараметрыСоединения = доп_сл_сервер.ПолучитьСтруктуруНастроекСоединения(РезультатЗапросаВыборка.АдресСервераЛицензий, РезультатЗапросаВыборка.ПортСервераЛицензий, РезультатЗапросаВыборка.ПортАссистента, РезультатЗапросаВыборка.ИспользоватьProxy);
				доп_сл_сервер.ОтключитьсяОтСервера(РезультатЗапросаВыборка.ИдентификаторСеанса, ПараметрыСоединения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
Процедура Инициализировать()
	Если Не ПользовательскоеСеансовоеХранилищеИнициализировано() Тогда
		ИнициализироватьПользовательскоеСеансовоеХранилище(Истина);
		ИнициализироватьПользовательскоеПостоянноеХранилище();
	КонецЕсли;
КонецПроцедуры
Функция ВерсияКлиентаИнтеграции() Экспорт
	Возврат "1.0.0";
КонецФункции
Функция ПолучитьИмяКлиента() Экспорт
	Возврат "lsaAPI-1C; ClientVer:" + Формат(ВерсияКлиентаИнтеграции(), "ЧРД=.; ЧГ=0") + "; From: " + Метаданные.Имя + "; FromVer: " + Метаданные.Версия + ";";
КонецФункции
Функция СформироватьОтчетПоОбъектуРезультата(ОбъектРезультат) Экспорт
	Результат = "";
	Результат = "Код: " + Формат(ОбъектРезультат.fields.Code, "ЧДЦ=0; ЧН=0; ЧГ=0");
	Результат = Результат + Символы.ПС + "Описание: '" + ОбъектРезультат.fields.Description + "'";
	Если ОбъектРезультат.fields.Comment <> "" Тогда
		Результат = Результат + Символы.ПС + "Комментарий: '" + ОбъектРезультат.fields.Comment + "'";
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция НетОшибок(ОбъектРезультат) Экспорт
	Возврат ОбъектРезультат.fields.Code = 0;
КонецФункции
Функция ПолучитьНастройкиСоединения()
	СтруктураПараметровСоединения = доп_сл_сервер.ПолучитьНастройкиСоединения();
	Результат = Новый Структура;
	Сервер = СтруктураПараметровСоединения.IP;
	Порт = СтруктураПараметровСоединения.ПортАссистентаСервераЛицензий;
	Логин = "lsaAPI-1C-Client";
	Пароль = "";
	ProxyИспользуется = СтруктураПараметровСоединения.ИспользоватьProxy;
	ProxyНастройкиИзСистемы = Истина;
	ProxyИспользоватьАутентификациюОС = Ложь;
	ProxyСервер = "";
	ProxyПорт = Неопределено;
	ProxyЛогин = "";
	ProxyПароль = "";
	ProxyИспользоватьДляЛокальныхАдресов = Ложь;
	Результат.Вставить("Сервер", Сервер);
	Результат.Вставить("Порт", Порт);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ProxyИспользуется", ProxyИспользуется);
	Результат.Вставить("ProxyНастройкиИзСистемы", ProxyНастройкиИзСистемы);
	Результат.Вставить("ProxyИспользоватьАутентификациюОС", ProxyИспользоватьАутентификациюОС);
	Результат.Вставить("ProxyСервер", ProxyСервер);
	Результат.Вставить("ProxyПорт", ProxyПорт);
	Результат.Вставить("ProxyЛогин", ProxyЛогин);
	Результат.Вставить("ProxyПароль", ProxyПароль);
	Результат.Вставить("ProxyИспользоватьДляЛокальныхАдресов", ProxyИспользоватьДляЛокальныхАдресов);
	Возврат Результат;
КонецФункции
Функция ИнициализироватьРезультат(КодРезультата = 0, Комментарий = "")
	МассивДополнительныхПараметров = Новый Массив;
	Результат = Новый Структура;
	СтруктураПоля = Новый Структура;
	КодСтрока = "ОписаниеКодаРезультатаАссистента_" + Формат(КодРезультата, "ЧГ=0;ЧН=0");
	Если КодРезультата < 10 Тогда
		Описание = доп_сл_общий.ПолучитьСтрокуСообщения(КодСтрока);
	Иначе
		Описание = доп_сл_общий.ПолучитьСтрокуСообщения("ОписаниеКодаРезультатаАссистентаНеЗаполнено");
	КонецЕсли;
	Результат.Вставить("type", "lsaAPI-1C.TError");
	Результат.Вставить("id", 1);
	СтруктураПоля.Вставить("Code", КодРезультата);
	СтруктураПоля.Вставить("Comment", Комментарий);
	СтруктураПоля.Вставить("Description", Описание);
	СтруктураПоля.Вставить("MethodResult", "");
	СтруктураПоля.Вставить("ExecutionTimeFrom1c", - 1);
	СтруктураПоля.Вставить("ExecutionTimeFrom1cHttpOnly", - 1);
	Результат.Вставить("fields", СтруктураПоля);
	Возврат Результат;
КонецФункции
Функция JSON_Записать(СериализуемыйОбъект)
	ЗаписьДжейсонБорн = Новый ЗаписьJSON;
	ЗаписьДжейсонБорн.ПроверятьСтруктуру = Истина;
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	ЗаписьДжейсонБорн.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьДжейсонБорн, СериализуемыйОбъект, НастройкиСериализации);
	Результат = ЗаписьДжейсонБорн.Закрыть();
	Возврат Результат;
КонецФункции
Функция JSON_Прочитать(СтрокаJSON)
	ЧтениеДжейсонБорн = Новый ЧтениеJSON;
	ЧтениеДжейсонБорн.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(ЧтениеДжейсонБорн, Ложь);
	Возврат Результат;
КонецФункции
Функция ЗначениеОпределено(Знач Значение)
	Возврат Значение <> Неопределено;
КонецФункции
Функция РегламентноеЗаданиеОтключено() Экспорт
	Результат = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", "191E9C9E-44E9-434F-9D23-C1236EE7FD22");
	НайденныеРЗ = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Если НайденныеРЗ.Количество() > 0 Тогда
		РЗОбъект = НайденныеРЗ[0];
		Результат = Не РЗОбъект.Использование;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПроверитьНеобходимостьОбновленияАссистента() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ТребуетсяОбновление", Ложь);
	Результат.Вставить("Сообщение", "");
	ApiInfoResult = lsaAPI_GetAPIInfo();
	Если НетОшибок(ApiInfoResult) Тогда
		Если ApiInfoResult.fields.MethodResult.fields.APIVersion < 1.01 Тогда
			Результат.ТребуетсяОбновление = Истина;
			ПараметрыСообщения = Новый Соответствие;
			ПараметрыСообщения.Вставить("##1##", "1.6.5.167");
			Результат.Сообщение = доп_сл_общий.ПолучитьСтрокуСообщения("ТребуетсяОбновлениеСервера", ПараметрыСообщения);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Процедура НастроитьРегламентноеЗадание() Экспорт
	РЗ = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.доп_сл_МенеджерСеансов);
	Если РЗ <> Неопределено Тогда
		Месяцы = Новый Массив;
		Для итератор = 1 По 12 Цикл
			Месяцы.Добавить(итератор);
		КонецЦикла;
		Дни = Новый Массив;
		Для итератор = 1 По 7 Цикл
			Дни.Добавить(итератор);
		КонецЦикла;
		РасписаниеРЗ = Новый РасписаниеРегламентногоЗадания;
		РасписаниеРЗ.ПериодНедель = 1;
		РасписаниеРЗ.ПериодПовтораДней = 1;
		РасписаниеРЗ.ПериодПовтораВТечениеДня = 30;
		РасписаниеРЗ.Месяцы = Месяцы;
		РасписаниеРЗ.ДниНедели = Дни;
		РЗ.ИнтервалПовтораПриАварийномЗавершении = 0;
		РЗ.КоличествоПовторовПриАварийномЗавершении = 0;
		РЗ.Расписание = РасписаниеРЗ;
		РЗ.Использование = Истина;
		РЗ.Записать();
	КонецЕсли;
КонецПроцедуры
Функция Преобразование_ДатаВремяВUnixTimeStamp(Знач ДатаВремя, ПривестиКUTC = Истина) Экспорт
	Если ДатаВремя = Дата("00010101") Тогда
		Возврат 0;
	КонецЕсли;
	Если ПривестиКUTC Тогда
		ДатаВремя = УниверсальноеВремя(ДатаВремя);
	КонецЕсли;
	Если ДатаВремя < Дата("19700101") Тогда
		Возврат 0;
	Иначе
		Возврат Формат(Число(ДатаВремя - Дата("19700101")), "ЧН=0; ЧГ=0");
	КонецЕсли;
КонецФункции
Функция Преобразование_UnixTimeStampВДатаВремя(Знач UnixTimeStamp, ПривестиКЛокальномуВремени = Истина) Экспорт
	ДатаВремя = Дата("19700101") + UnixTimeStamp;
	Если ДатаВремя = Дата("19700101") Тогда
		Возврат Дата("00010101");
	КонецЕсли;
	Если ПривестиКЛокальномуВремени Тогда
		ДатаВремя = МестноеВремя(ДатаВремя);
	КонецЕсли;
	Возврат ДатаВремя;
КонецФункции
Функция lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив = Неопределено, sid = "")
	НачалоИсполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НачалоИсполненияHttp = - 1;
	ЗавершениеИсполненияHttp = - 1;
	ИсходящаяСтрока = "";
	ВходящаяСтрока = "";
	Результат = ИнициализироватьРезультат(0);
	lsaAPI_Settings = ПолучитьНастройкиСоединения();
	Если ИсходящиеПараметрыМассив <> Неопределено И ИсходящиеПараметрыМассив.Количество() > 0 Тогда
		Попытка
			JSON_Объект = Новый Структура;
			JSON_Объект.Вставить("_parameters", ИсходящиеПараметрыМассив);
			ИсходящаяСтрока = JSON_Записать(JSON_Объект);
		Исключение
			Результат = ИнициализироватьРезультат(5, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		SSL = Новый ЗащищенноеСоединениеOpenSSL;
		Если lsaAPI_Settings.ProxyИспользуется Тогда
			Если lsaAPI_Settings.ProxyНастройкиИзСистемы Тогда
				Прокси = Новый ИнтернетПрокси(Истина);
			Иначе
				Прокси = Новый ИнтернетПрокси(Ложь);
				Прокси.Установить("https", lsaAPI_Settings.ProxyСервер, lsaAPI_Settings.ProxyПорт, lsaAPI_Settings.ProxyЛогин, lsaAPI_Settings.ProxyПароль, lsaAPI_Settings.ProxyИспользоватьАутентификациюОС);
				Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Не lsaAPI_Settings.ProxyИспользоватьДляЛокальныхАдресов;
			КонецЕсли;
		Иначе
			Прокси = Новый ИнтернетПрокси(Ложь);
			Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
		КонецЕсли;
		Соединение = Новый HTTPСоединение(lsaAPI_Settings.Сервер, lsaAPI_Settings.Порт, lsaAPI_Settings.Логин, lsaAPI_Settings.Пароль, Прокси, 5, SSL);
		SessionID = ?(sid = "", "", "?sid=" + sid);
		Запрос = Новый HTTPЗапрос("/lsaAPI/rest/TNode1/""" + MethodName + """/" + SessionID);
		Если ИсходящаяСтрока <> "" Тогда
			Запрос.УстановитьТелоИзСтроки(ИсходящаяСтрока, "UTF-8");
		КонецЕсли;
		НачалоИсполненияHttp = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Попытка
			HTTPОтвет = Соединение.Записать(Запрос);
		Исключение
			Результат = ИнициализироватьРезультат(1, ОписаниеОшибки());
		КонецПопытки;
		ЗавершениеИсполненияHttp = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Если НетОшибок(Результат) Тогда
			ВходящаяСтрока = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
			Если HTTPОтвет.КодСостояния <> 201 Тогда
				Результат = ИнициализироватьРезультат(3, "Получен код: " + HTTPОтвет.КодСостояния + ", ожидался: 201.");
			КонецЕсли;
			Если НетОшибок(Результат) Тогда
				Попытка
					JSON_ОбъектРезультат = JSON_Прочитать(ВходящаяСтрока);
					Если Не JSON_ОбъектРезультат.Свойство("result") Или ТипЗнч(JSON_ОбъектРезультат.result) <> Тип("Массив") Или ТипЗнч(JSON_ОбъектРезультат.result[0]) <> Тип("Структура") Или Не JSON_ОбъектРезультат.result[0].Свойство("type") Тогда
						Результат = ИнициализироватьРезультат(7);
					КонецЕсли;
					Если НетОшибок(Результат) Тогда
						Если ВРег(ExpectedJSONObjectName) <> ВРег(JSON_ОбъектРезультат.result[0].type) Тогда
							Результат = ИнициализироватьРезультат(8, "Входящий объект:" + JSON_ОбъектРезультат.result[0].type);
						КонецЕсли;
					КонецЕсли;
				Исключение
					Результат = ИнициализироватьРезультат(2, ОписаниеОшибки());
				КонецПопытки;
				Если НетОшибок(Результат) Тогда
					Результат = JSON_ОбъектРезультат.result[0];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗавершениеИсполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат.fields.ExecutionTimeFrom1c = ЗавершениеИсполнения - НачалоИсполнения;
	Если НачалоИсполненияHttp <> - 1 И ЗавершениеИсполненияHttp <> - 1 Тогда
		Результат.fields.ExecutionTimeFrom1cHttpOnly = ЗавершениеИсполненияHttp - НачалоИсполненияHttp;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция Node1_TRestClientInfo(ClientMethodVersion)
	RestClientInfo = Новый Структура;
	RestClientInfo.Вставить("type", "Node1.TRestClientInfo");
	RestClientInfo.Вставить("id", 1);
	fields = Новый Структура;
	fields.Вставить("Name", ПолучитьИмяКлиента());
	fields.Вставить("PreferredLanguage", "Russian");
	fields.Вставить("ClientMethodVersion", ClientMethodVersion);
	RestClientInfo.Вставить("fields", fields);
	Возврат RestClientInfo;
КонецФункции
Функция lsaAPI_GetAPIInfo(ReturnMethodInfo = Ложь, sid = "") Экспорт
	MethodName = "GetAPIInfo";
	ExpectedJSONObjectName = "Node1.TRestResult<Node1.TAPIInfo>";
	MethodVersion = 1.01;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	ИсходящиеПараметрыМассив.Добавить(ReturnMethodInfo);
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив, sid);
	Возврат Результат;
КонецФункции
Функция lsaAPI_CreateSession() Экспорт
	MethodName = "CreateSession";
	ExpectedJSONObjectName = "Node1.TRestResult<System.String>";
	MethodVersion = 1;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив);
	Возврат Результат;
КонецФункции
Функция lsaAPI_DestroySession(sid) Экспорт
	MethodName = "DestroySession";
	ExpectedJSONObjectName = "Node1.TRestResult<System.String>";
	MethodVersion = 1;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив, sid);
	Возврат Результат;
КонецФункции
Функция lsaAPI_GetSessionID(sid = "") Экспорт
	MethodName = "GetSessionID";
	ExpectedJSONObjectName = "Node1.TRestResult<System.String>";
	MethodVersion = 1;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив, sid);
	Возврат Результат;
КонецФункции
Функция lsaAPI_EchoString(Value, sid = "") Экспорт
	MethodName = "EchoString";
	ExpectedJSONObjectName = "Node1.TRestResult<System.String>";
	MethodVersion = 1;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	ИсходящиеПараметрыМассив.Добавить(Value);
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив, sid);
	Возврат Результат;
КонецФункции
Функция lsaAPI_EchoDateTime(Value, sid = "") Экспорт
	MethodName = "EchoDateTime";
	ExpectedJSONObjectName = "Node1.TRestResult<System.Int64>";
	MethodVersion = 1;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	UnixDateTime = Преобразование_ДатаВремяВUnixTimeStamp(Value);
	ИсходящиеПараметрыМассив.Добавить(UnixDateTime);
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив, sid);
	Если НетОшибок(Результат) Тогда
		Результат.fields.MethodResult = Преобразование_UnixTimeStampВДатаВремя(Результат.fields.MethodResult);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция lsaAPI_SlCallLicenseServerMethod(ServerPort, ParamStr, VirtConnectionID = "", sid = "", AutoReleaseLicense = Истина) Экспорт
	MethodName = "SlCallLicenseServerMethod";
	ExpectedJSONObjectName = "Node1.TRestResult<Node1.TSlCallLicenseServerMethodResult>";
	MethodVersion = 1;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	ИсходящиеПараметрыМассив.Добавить(ServerPort);
	ИсходящиеПараметрыМассив.Добавить(ParamStr);
	ИсходящиеПараметрыМассив.Добавить(VirtConnectionID);
	ИсходящиеПараметрыМассив.Добавить(AutoReleaseLicense);
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив, sid);
	Возврат Результат;
КонецФункции
Функция lsaAPI_SlExtendAssistantSessionLifeTime(sid = "")
	MethodName = "SlExtendAssistantSessionLifeTime";
	ExpectedJSONObjectName = "Node1.TRestResult<System.Boolean>";
	MethodVersion = 1;
	ИсходящиеПараметрыМассив = Новый Массив;
	ИсходящиеПараметрыМассив.Добавить(Node1_TRestClientInfo(MethodVersion));
	Результат = lsaAPI_Execute(MethodName, ExpectedJSONObjectName, ИсходящиеПараметрыМассив, sid);
	Возврат Результат;
КонецФункции
